[
    {
        "id": 1,
        "parshaId": 0,
        "vort": [
            "In Parshas Bereshis, we learn many important lessons, but none more powerful and enduring than the significance and holiness of words and speech. The Torah teaches us that God created the world through ten utterances: through Divine speech. With each holy command, our universe was formed. Hashem implanted this gift of speech within man. Of all earth’s creatures, only humans are endowed with the ability to verbally communicate intelligently. We must be ever mindful that, even as God created through “words,” on our own level, we too create through words./\r\n\r\n\r\n\r\nTime and again, the Torah cautions us to be very careful with that which escapes our lips, for, as King Solomon tells us, “Death and life are in the tongue.” Before speaking, stop for a moment and consider how your words impact others. What sort of environment and relationships do you create with your speech? Do you speak to your family and friends with love and respect? Do you think about what you’re saying before you say it and the effect that it will have on those with whom you communicate? How careful are you with that which escapes from your lips?/\r\n\r\n\r\n\r\nThere are more commandments in the Torah in regard to speech than to any other mitzvah: seventeen negative and fourteen positive mitzvos. It is through speech that we signaled our commitment to our Covenant at Sinai when we proclaimed, “Na’aseh V’nishma — We shall do it and we shall study it.” It is through speech — prayer — that we speak to God on a daily basis, bringing a positive spiritual influence into the mundane. Yet speech can have terribly negative effects as well: It was through speech that Hitler committed the most unspeakable evil ever to be perpetrated upon mankind. He himself never lifted a weapon; he used his lethal tongue to incite the world to hatred and slaughter. Indeed, “Death and life are in the tongue.”/\r\n\r\n\r\n\r\nThink before you speak and ask yourself, “Will my words generate light or darkness, love or hatred, blessing or curse?” The choice is yours to make. Use your Divine gift of speech carefully and wisely, in the service of the Almighty."
        ]
    },
    {
        "id": 2,
        "parshaId": 1,
        "vort": [
            "Make for yourself an ark of gopher wood; make the ark with compartments, and cover it inside and out with pitch. (Genesis 6: 14)",
            "\r\n\r\nDaniel calls up his contractor and says",
            "I just bought a sizeable piece of land and would like you to build me a magnificent house. I would like the kitchen counters to be made from the finest granite...\"\r\n\r\nThe contractor interrupts Woah! Just slow down a little! First, we need to deal with the zoning, write up the blueprints and get a building permit. Then we'll begin with the details; how many floors and what type of materials. We have plenty of time until we begin discussing the kitchen counters..",
            ".!\"\r\n\r\nGod commanded Noah to build an ark. He gave Noah the building plans for the ark: make an ark of gopher wood and make many rooms. The ark should be covered inside and out with pitch. It should be 300 cubits in length, 50 cubits wide, and 30 cubits high. He then proceeds to the details, telling him how many floors there should be and where the window and door should be placed. It seems that the command to make",
            "many rooms",
            "is really out of place.",
            "God should've first finished explaining the basic structure before he told him about the",
            "many rooms",
            "!",
            "\r\n\r\nNow, if the main reason Daniel decided to build a new house was that he could not tolerate his kitchen counters, which were poor quality and looked terrible, then we would understand why one of the first things he mentioned was the counters. After all, that's why he wanted to move.",
            "\r\n\r\nThe same concept applies to the ark. The behavior of the people was so corrupt that it affected the animals as well until they too cohabited with other species. God, therefore, decided to destroy the world and start it over from scratch. Since His reason for destroying the world was because of the corruption it would make sense that the first thing He would care about in rebuilding the world was that it not get corrupt again; hence came the commandment to make many different rooms, since all the animals needed to be kept separate from other species.",
            "\r\n\r\n",
            "When a person turns over a new leaf and wants to change, he begins working hard and growing, but can often find himself falling back into the same hole. For example, a person switches schools to get away from bad influences, and yet before he knows it he's hanging out with the same type of crowd once again. The first step in the growing process is to create some plan to ensure the mistake doesn't repeat itself. Failing to plan is planning to fail."
        ]
    }
]